---
kind: type
id: T:Autodesk.Revit.DB.BooleanOperationsUtils
source: html/a7be98f3-9e8a-ee51-f46c-2479cb72c598.htm
---
# Autodesk.Revit.DB.BooleanOperationsUtils

These utilities are applicable for the geometry created by GeometryCreationUtilities and the geometry of Revit model.

## Syntax (C#)
```csharp
public class BooleanOperationsUtils : IDisposable
```